---
layout: post
status: publish
published: true
title: Ancora sull'Ipod touch..
author:
  RedBlue
author_login: aDMINniSTRAtor
author_email: redblue@red-blue.it
author_url: http://www.red-blue.it
wordpress_id: 157
wordpress_url: http://redblue.netsons.org/?p=157
date: '2009-01-18 15:08:49 +0100'
date_gmt: '2009-01-18 14:08:49 +0100'
categories:
- tips & tricks
- hi-tech
tags:
- apple
- ipod touch
- impressioni
- itunes
- videora
- super
- app store
- wireless
comments: []
---
<p>Bene.. Una settimana di utilizzo del mio nuovo gioiellino, un Ipod touch si seconda generazione con firmware 2.0 (che poi ho upgradato gratuitamente alla versione 2.2 tramite iTunes).. E' tempo di dare un p&ograve; di impressioni: inutile dire che il software di casa <strong>Apple</strong> &egrave; troppo figo, il <strong>touchscreen</strong> &egrave; pressoch&egrave; perfetto (ho avuto modo di utilizzare un Samsung Omnia un lettore mp3 touch della Nortek, e posso dire che non sono minimamente comparabili) e il <strong>multi-touch</strong> &egrave; a dir poco affascinante. Devo dire che sono rimasto stupefatto dalla resa audio e video.. I filmati che ho caricato come prova di vedono in maniera pressoch&egrave; perfetta, e per quanto riguarda l'audio, &egrave; nettamente superiore al mio vecchio Ipod Nano (ch&egrave; gi&agrave; era fenomenale)! Fantastico!! Per chi fosse interessato, consiglio come programma di conversione per i video il <a href="http://www.videora.com/en-us/Converter/iPod/" target="_blank">Videora Ipod Converter</a>, freeware semplicissimo da usare e molto completo (probabilmente potrebbe darvi l'errore 100000 con qualsiasi filmato che tentate di convertire, &egrave; un bug dell'ultima versione, <a href="http://www.italiamac.it/forum/showthread.php?t=196786" target="_blank">qui</a> la soluzione all'inconveniente), e il <a href="http://www.erightsoft.net/SUPER.html" target="_blank">SUPER</a>, anch'esso freeware e forse anche pi&ugrave; potente.</p>
<p>Ricchissima la dotazione software, dal browser <strong>Safari</strong>, eccellente, alla gestione delle email (con la possibilit&agrave; di configurare pi&ugrave; accunt), il collegamento diretto a<strong> YouTube</strong>, alla Borsa, a <strong>Google Maps</strong>, al servizio meteo di <strong>Yahoo!</strong>, fino allo storico iTunes Music Store e al nuovo <strong>App Store</strong>. Proprio quest'ultimo mi ha lasciato piacevolmente sorpreso: dopo aver registrato un Apple ID per poter accedere allo store (&egrave; necessaria una carta di credito o una Postepay, ma dopo la registrazione personalmente ho tolto la mia carta dai metodi di pagamento, in modo da non trovarmi sgradite sorprese), &egrave; iTunes stesso a sincronizzare questo ID con l'Ipod, in modo da trovarsi gi&agrave; tutto pronto al momento della connessione. A questo punto si pu&ograve; scegliere tra applicazioni a pagamento e applicazione gratuite, per le quali non c'&egrave; alcun costo (nemmeno relativo al download); devo dire che mi aspettavo applicazioni "stupide", per cos&igrave; dire, invece mi sono trovato un'ampia libreria comprendente giochi (anche se molti in versione Lite, non demo attenzione) e applicazioni (per citarne una famosa di questi tempi, <strong>Facebook</strong>) assolutamente utilizzabili, e in alcuni casi addirittura utili.. Insomma ancora una volta complimenti alla Apple!!</p>
<p>Ps. Ovviamente per utilizzare tutti i servizi che ho appena descritto &egrave; necessario essere <strong>sotto copertura di una rete wireless</strong>!!</p>
