---
layout: post
status: publish
published: true
title: Breaking News - Ho deciso di cambiare distribuzione Linux..
author:
  RedBlue
author_login: aDMINniSTRAtor
author_email: redblue@red-blue.it
author_url: http://www.red-blue.it
wordpress_id: 947
wordpress_url: http://redblue.netsons.org/?p=947
date: '2010-02-03 08:35:10 +0100'
date_gmt: '2010-02-03 07:35:10 +0100'
categories:
- io
- linux
- riflessioni
tags:
- cambiamento
- linux
- ubuntu
- distribuzioni
- fedora
- mandriva
- slackware
- arch
- consigli
comments:
- id: 3093
  author: V
  author_email: vittorio.re@gmail.com
  author_url: ''
  date: '2010-02-04 00:08:57 +0100'
  date_gmt: '2010-02-03 23:08:57 +0100'
  content: "mah,\r\nio iniziai con redhat (all'epoca era la 4.qualcosa) e poi passai
    a mandrake con un breve intermezzo di suse.\r\nho provato anche debian, ma negli
    ultimi anni mi sono limitato a ubuntu (o kubuntu), anche perch&eacute; dovendo
    il pc essere usato anche da mia moglie che non ha molta familiarit&agrave; con
    i pc, la scelta era quasi obbligata.\r\n\r\ndicono per&ograve; che un vero linux
    die hard non si possa chiamare tale se non si &egrave; mai cimentato con slackware
    :)"
- id: 3096
  author: RedBlue
  author_email: redblue@redblue.netsons.org
  author_url: http://redblue.netsons.org
  date: '2010-02-04 11:00:48 +0100'
  date_gmt: '2010-02-04 10:00:48 +0100'
  content: Mmm.. Il fatto &egrave; che non credo di potermi ancora definire un "linux
    die hard"!! Slack l'ho provata in passato, ed effettivamente da soddisfazione,
    ma ci vuole veramente pazienza per usarla stabilmente.. Vedremo nei prossimi giorni..
- id: 3098
  author: V
  author_email: vittorio.re@gmail.com
  author_url: ''
  date: '2010-02-04 23:57:41 +0100'
  date_gmt: '2010-02-04 22:57:41 +0100'
  content: "piuttosto, finora per le sperimentazioni usavo una partizione del disco
    su cui andavo ad installare la distribuzione da testare.\r\nvorrei invece provare
    una macchina virtuale. tu hai esperienze in merito?"
- id: 3099
  author: RedBlue
  author_email: redblue@redblue.netsons.org
  author_url: http://redblue.netsons.org
  date: '2010-02-05 01:24:04 +0100'
  date_gmt: '2010-02-05 00:24:04 +0100'
  content: Io uso VirtualBox.. Non la versione che si trova nei repository per&ograve;
    (licenza OSE), ma quella scaricabile dal sito ufficiale (licenza PUEL).. E' un
    software opensource totalmente gratuito arrivato ad un livello di virtualizzazione
    piuttosto notevole..
- id: 3182
  author: niki
  author_email: darinni@tiscali.it
  author_url: ''
  date: '2010-02-17 14:30:40 +0100'
  date_gmt: '2010-02-17 13:30:40 +0100'
  content: ciao io dopo 10 anni di fedora 7 ho piallato tutto x una fantastica hymera
    open 1.0 - fanatstica stabile tante cose gi&agrave; di default con fantastici
    effetti grafici che con fedora mi aveva mandato tutto in pallone io se fossi in
    te proverei.baci niki
- id: 3183
  author: RedBlue
  author_email: redblue@redblue.netsons.org
  author_url: http://redblue.netsons.org
  date: '2010-02-17 15:00:36 +0100'
  date_gmt: '2010-02-17 14:00:36 +0100'
  content: Mmm.. Compatibilit&agrave; con l'hardware a che livello?
- id: 6370
  author: Arch Linux - RedBlue&#39;s Blog
  author_email: ''
  author_url: http://www.red-blue.it/linux/arch-linux.html
  date: '2010-06-19 11:31:24 +0100'
  date_gmt: '2010-06-19 10:31:24 +0100'
  content: "[...] tempo fa (cfr. &#8220;Ho deciso di cambiare distribuzione Linux..&#8220;)
    scrissi che avevo intenzione di cambiare distribuzione.. B&egrave; penso che sia
    chiaro che non [...]"
---
<p>Perch&egrave;? Perch&egrave; &egrave; ora.. Ci sono cose che prima non sapevo fare e per questo ho installato <strong>Ubuntu</strong>, ma ora quelle cose so farle.. E' il momento di cambiare..</p>
<p>Quale distribuzione adotter&ograve;? Questa &egrave; una bella domanda.. Potrei tornare a <strong>Debian</strong>, quella che avevo all'inizio e che poi ho accantonato quando alcuni problemi mi sono sembrati insormontabili.. Probabilmente quei problemi ora li saprei superare.. O potrei passare ad <strong>Arch</strong>, con la quale sto gi&agrave; facendo un test su un altro pc.. O perch&egrave; no, ampliare i test fatti in passato con distribuzioni come <strong>Slackware</strong>, <strong>Fedora</strong> e <strong>Mandriva</strong>.. Di sicuro &egrave; che per un bel p&ograve; continuer&ograve; ad avere Ubuntu sul mio pc principale, il passaggio deve fisiologicamente avvenire gradualmente (causa impegni e necessit&agrave; varie)..</p>
<p>Si accettano consigli.. Mi parlate un p&ograve; delle vostre esperienze??</p>
<p style="text-align: center;"><a rel="lightbox" href="/assets/images/linuxlogo.jpg"><img class="aligncenter" src="/assets/images/linuxlogo.jpg" alt="" width="368" height="141" /></a></p>
