---
layout: post
status: publish
published: true
title: Uno sguardo su Wordpress 3.0
author:
  RedBlue
author_login: aDMINniSTRAtor
author_email: redblue@red-blue.it
author_url: http://www.red-blue.it
wordpress_id: 1121
wordpress_url: http://redblue.netsons.org/?p=1121
date: '2010-05-15 19:15:52 +0100'
date_gmt: '2010-05-15 18:15:52 +0100'
categories:
- blog
- wordpress
tags:
- blog
- wordpress
- '3.0'
comments:
- id: 6395
  author: Aggiornamento blog.. - RedBlue&#039;s Blog
  author_email: ''
  author_url: http://www.red-blue.it/blog/aggiornamento-blog-8.html
  date: '2010-07-10 16:19:00 +0100'
  date_gmt: '2010-07-10 15:19:00 +0100'
  content: "[...] finalmente passato alla versione 3.0 di WordPress, di cui avevo
    parlato tempo fa (cfr. &#8220;Uno sguardo su WordPress 3.0&#8220;) e che porta
    con s&eacute; una valanga di aggiornamenti e nuove funzionalit&agrave;.. Perch&egrave;
    aggiorno [...]"
- id: 7195
  author: Marco Ufficio
  author_email: info@altamail.org
  author_url: http://www.lamercanti.it
  date: '2011-04-24 16:52:06 +0100'
  date_gmt: '2011-04-24 14:52:06 +0100'
  content: Ma quindi esiste o no questa versione MU? L'hanno eliminata?
- id: 7196
  author: RedBlue
  author_email: redblue@red-blue.it
  author_url: http://www.red-blue.it
  date: '2011-04-24 17:03:49 +0100'
  date_gmt: '2011-04-24 15:03:49 +0100'
  content: A partire da WP 3.0 &egrave; stata inglobata nella main release.. Leggi
    <a href="http://www.wpmu.it/" rel="nofollow">qui</a>.. ;)
---
<p>Tra poco, &egrave; prevista per questo mese, sar&agrave; rilasciata la versione <strong>3.0</strong> di <strong>Wordpress</strong>, la piattaforma usata da milioni di blog in tutto il mondo, compreso questo..</p>
<p>Preso da un'irrefrenabile curiosit&agrave;, ho scaricato e provato in locale la <strong>Beta 2</strong>, rilasciata recentemente.. Le novit&agrave; ci sono e sono tante, com'&egrave; giusto che sia per una major release che si rispetti, vediamo le principali..</p>
<p style="text-align: center;"><a rel="lightbox" href="/assets/images/wordpress-smbutton-blue.png"><img class="aligncenter" title="Wordpress Logo" src="/assets/images/wordpress-smbutton-blue.png" alt="" width="58" height="69" /></a></p>
<p><strong>Definizione dell'account admin durante l'installazione</strong>: fino ad ora durante l'installazione veniva creato l'account admin, che poteva poi essere modificato successivamente con la nostra password, da questa versione invece tale account viene definito direttamente in fase di installazione.</p>
<p><strong>Gestione dei menu</strong>: &egrave; ora possibile creare un menu di navigazione interno, o ibrido tra pagine interne e link esterni, direttamente dal pannello di amministrazione, con una semplicissima procedura di drag'n'drop. Addirittura poi si pu&ograve; convertire tale menu in un widget da posizionare dove meglio crediamo (ovviamente questo dipende anche dal tema usato).</p>
<p><strong>Nuovo tema di default</strong>: si chiama Twenty Ten, e stacca decisamente dal passato.. Sinceramente non lo trovo granch&egrave; bello, ma gli sviluppatori dicono che ancora non &egrave; del tutto completo, e inoltre nelle intenzioni ogni anno dovrebbe essere variato e migliorato.. Twenty Ten consente inoltre di modificare in pochi click l'immagine dell'header e dello sfondo, consentendoci di usarne altre a nostra scelta.</p>
<p><strong>Integrazione di Worpress MU</strong>: la versione multi-utente di WP &egrave; stata abbandonata, e il suo codice &egrave; integrato in WP 3.0; significa che ora &egrave; possibile controllare pi&ugrave; blog con una sola installazione. Si tratta ovviamente di una caratteristica riservata ai pi&ugrave; esperti, ma non si pu&ograve; non citarla, &egrave; una vera rivoluzione.</p>
<p><strong>Post personalizzati</strong>: finora si possono creare articoli, pagine e semplici post.. Nella nuova versione sar&agrave; possibile personalizzare i contenuti, in modo da differenziare ad esempio il tema degli articoli che trattano un certo argomento rispetto agli altri, oppure, in caso di blog pi&ugrave; "professionali", distiguere dalle altre determinate pagine.</p>
<p>Alla prossima..</p>
