---
layout: post
status: publish
published: true
title: Il mio primo server!!
author:
  RedBlue
author_login: aDMINniSTRAtor
author_email: redblue@red-blue.it
author_url: http://www.red-blue.it
wordpress_id: 2257
wordpress_url: http://www.red-blue.it/?p=2257
date: '2011-08-08 15:25:38 +0100'
date_gmt: '2011-08-08 13:25:38 +0100'
categories:
- io
- linux
- ubuntu
- internet
- server
tags:
- server
- linux
- ubuntu
- installazione
- '10.04'
- lts
- configurazione
comments:
- id: 7757
  author: Scugnizzo
  author_email: axelinside@gmail.com
  author_url: ''
  date: '2011-08-08 17:12:57 +0100'
  date_gmt: '2011-08-08 15:12:57 +0100'
  content: "In bocca al lupo.\r\nSeguir&ograve; con curiosit&agrave; la tua avventura,
    per il momento non ho esigenza voglia e tempo di fare qualcosa di simile ma qualora
    un giorno mi ci dovessi cimentare meglio non essere proprio a digiuno :-)\r\n\r\nCiao"
---
<p>In questi giorni sono alle prese con la configurazione del mio (si spera) primo <strong>server</strong>!!</p>
<p>Perch&egrave; mi chiederete voi?? B&egrave; diciamo che &egrave; un ambito in cui mi sono sempre cimentato poco o niente, per mancanza di opportunit&agrave; e di tempo, ma &egrave; un ambito che mi ha sempre molto attratto.</p>
<p>E allora, approfittando di un periodo di calma piatta, ho deciso di riesumare il mio storico Pentium 3 e vedere di cosa &egrave; capace una volta trasformato in un piccolo server "<strong>domestico</strong>"; l'obiettivo finale &egrave; quello di mettere su una <strong>rete locale</strong> tra gli altri pc che sia "regolata" da questo server, quindi accesso ad internet attraverso il server e navigazione solo in quei siti considerati leciti dal server. Un qualcosa di abbastanza didattico per cominciare insomma, ci sar&agrave; tempo e modo per installare e configurare altri aspetti..</p>
<p><!--moreContinua a leggere.. --></p>
<p>Il che mi da la possibilit&agrave; di inaugurare questa serie di articoli, una specie di diario online di quello che riuscir&ograve; a combinare, magari chiss&agrave; di trovare una mano per risolvere i problemi che, ne sono certo, si presenteranno e, perch&egrave; no, essere d'aiuto a chi volesse cimentarsi nella stessa attivit&agrave;.. ;)</p>
<p>Allora, iniziamo dalla configurazione del pc, si tratta di un vecchio <strong>Pentium 3 800 MHz</strong>, con a bordo <strong>512 MB di Ram</strong> e un hard disk da soli <strong>20 GB</strong>, equipaggiato poi con <strong>due schede ethernet</strong> (una collegata al router di casa, l'altra che servir&agrave; per la lan). Completano la configurazione una scheda video da 128 MB se non ricordo male, una scheda audio di cui non so assolutamente nulla, tastiera, monitor e mouse, tutta roba che dovrebbe, alla fine, risultare superflua..</p>
<p>Come distribuzione ho scelto <strong>Ubuntu Server 10.04 LTS</strong>, per due semplici motivi: Ubuntu &egrave; la distribuzione Linux con cui ho maggiore familiarit&agrave; (anche se &egrave; la prima volta che installo la Server), e secondo perch&egrave; la LTS per server garantisce supporto per ben 5 anni, per cui mi &egrave; sembrata pi&ugrave; stabile e sicura dell'ultima nata..</p>
<p>Pronti via, il primo passo &egrave; la masterizzazione su CD (questo vecchio PC non ha la possibilit&agrave; di essere avviato direttamente da USB) e l'installazione su disco fisso dell'OS. Questo passo &egrave; decisamente semplice, si tratta praticamente dell'installazione classica di Ubuntu, l'unico accorgimento &egrave; che alla richiesta riguardo l'installazione di servizi aggiuntivi, ho scelto di non installarne alcuno, in quanto, come dicevo prima, questo &egrave; un esperimento "didattico", e allora devo fare tutto io.. ;)</p>
<p>Fine prima puntata direi..</p>
<p>Alla prossima..</p>
