---
layout: post
status: publish
published: true
title: Ubuntu per Android, riflessioni e dubbi
author:
  RedBlue
author_login: aDMINniSTRAtor
author_email: redblue@red-blue.it
author_url: http://www.red-blue.it
wordpress_id: 2941
wordpress_url: http://www.red-blue.it/?p=2941
date: '2012-02-24 11:26:35 +0100'
date_gmt: '2012-02-24 10:26:35 +0100'
categories:
- linux
- hi-tech
- riflessioni
- in evidenza
- android
tags:
- linux
- ubuntu
- kernel
- android
- ubuntu per android
- docking station
comments: []
---
<p>In questi giorni, la rete &egrave; in subbuglio per un annuncio epico: <strong>Ubuntu per Android</strong>.</p>
<p><a href="/assets/images/ubuntuandroid.jpg"><img class="aligncenter size-medium wp-image-2944" title="ubuntuandroid" src="/assets/images/ubuntuandroid-300x182.jpg" alt="" width="300" height="182" /></a></p>
<p><strong>Di che si tratta?</strong> B&egrave; diciamo che dovrebbe trattarsi della possibilit&agrave; di avviare Ubuntu <strong>all'interno</strong> di Android, quasi come fosse un'app. Ma attenzione, il concetto &egrave; un pochino diverso, e fondamentalmente si basa sulla <strong>condivisione del kernel tra Android e Ubuntu</strong> (Android, non dimentichiamolo mai, &egrave; basato sul kernel Linux), tanto che sar&agrave; anche possibilie avviare applicazioni Android da Ubuntu (in una sorta di viceversa insomma).</p>
<p><!--moreContinua a leggere..--></p>
<p>Quindi lo scenario &egrave; questo: sono in ufficio, connetto il mio smartphone ad un'apposita <strong>docking station</strong> e ad una tastiera e un monitor, e via.. Torno a casa, stessa storia, e addio a tutti gli altri dispositivi. Non solo, in qualunque momento e/o posto io mi trovi, posso collegare docking station, tastiera e monitor e ho il mio pc, con la mia Ubuntu, bello e pronto.</p>
<p><strong>Ma che figata</strong>, ho pensato subito. Poi per&ograve; mi sono iniziato a porre alcune domande, soprattutto due: <span style="text-decoration: underline;">&egrave; davvero una novit&agrave;? E serve davvero?</span></p>
<p><strong>La risposta alla prima domanda &egrave; ovvia, no!</strong> Gi&agrave; <strong>Motorola</strong> e <strong>Asus</strong> stanno sperimentando la possibilit&agrave; di estendere le funzionalit&agrave; di un <strong>tablet</strong> per farne un vero e proprio notebook, quindi l'idea di fare lo stesso con uno smartphone non &egrave; propriamente una novit&agrave;.</p>
<p>La seconda domanda ha una risposta pi&ugrave; complessa, e quello che vado a scrivere ovviamente &egrave; una mia idea: per prima cosa, cercando un pochino le caratteristiche di questo fantomatico smartphone, si capisce che (come era prevedibile) deve essere <strong>abbastanza potente</strong> (<span style="text-decoration: underline;">CPU dual core, buona dotazione di RAM, ottima dotazione video</span>), quindi diciamo che ad esempio io prima di sperimentare dovrei sostituire il mio fido HTC Desire con qualcosa di pi&ugrave; potente (ma la situazione &egrave; identica anche per tantissimi altri che possiedono terminali pi&ugrave; recenti del mio); in seconda analisi, stiamo parlando di avviare un sistema operativo all'interno di un altro, quindi siamo sicuri che non saremmo vittime di <strong>rallentamenti</strong> e, pi&ugrave; in generale, di <strong>bug</strong> dovuti a questa scelta? Ad esempio io so che Asus sta puntando ad usare direttamente Android come sistema operativo, non qualcosa che deve girare all'interno di Android.</p>
<p>E ancora, sull'effettiva utilit&agrave;.. Se l'esempio dell'ufficio che ho fatto prima mi sembra eccellente, un sicuro punto a favore di Ubuntu per Android, qualsiasi altro utilizzo sinceramente non mi sembra granch&egrave; pratico; quanti di noi si portano appresso monitor e tastiera? E quanti sarebbero felici di portarsi dietro, oltre allo smartphone che giocoforza non pu&ograve; avere dimensioni trascurabili, anche la docking station?</p>
<p>Mi viene in mente che, se questa idea prendesse effettivamente il largo (e <span style="text-decoration: underline;">non dubito che la possibilit&agrave; di avere tutto il proprio armamentario informatico concentrato nello smartphone prima o poi si concretizzer&agrave;</span>) verrebbero sviluppati tutta una serie di devices "di contorno", tipo tastiera portatile, monitor portatile, custodie in cui si integra la docking station, borse apposite per trasportare il tutto comodamente............</p>
<p>Ma.. Cos&igrave; non si otterrebbe un <strong>notebook</strong> praticamente??</p>
<p>Che ne pensate?</p>
<p>Alla prossima..</p>
